#pragma once
#include "Decoder.h"
#include <string>
#include <map>

using std::string;
using std::map;


class Ukr_decoder : public Decoder
{
public:

    Ukr_decoder();  //конструктор
    void Decode(string& Code); //метод початку процессу
    ~Ukr_decoder(); //деконструктор

private:

    int temp_key;   //тимчасова змінна для ключа
    double min_diff;    //тимчасова змінна для визначення мінімальної загальної астоти

    map <char, double> ukr_letter_freq = { {'а',8.34}, {'б',1.53}, {'в',5.50}, {'г',1.59}, {'ґ',0.01},  //мапа частот
                                           {'д',3.06}, {'е',4.59}, {'є',0.39}, {'ж',0.71}, {'з',2.10},
                                           {'и',6.00}, {'і',6.23}, {'ї',0.84}, {'й',1.24}, {'к',4.00},
                                           {'л',3.93}, {'м',3.02}, {'н',7.10}, {'о',9.28}, {'п',2.84},
                                           {'р',5.48}, {'с',4.57}, {'т',4.77}, {'у',3.38}, {'ф',0.35},
                                           {'х',1.17}, {'ц',1.02}, {'ч',1.15}, {'ш',0.71}, {'щ',0.32},
                                           {'ь',1.83}, {'ю',0.70}, {'я',2.16} };

    map <int, int> conversion_map = { {-32,-31}, {-31,-30}, {-30,-29}, {-29,-76}, {-76,-28},    //мапа переходів
                                      {-28,-27}, {-27,-70}, {-70,-26}, {-26,-25}, {-25,-24},
                                      {-24,-77}, {-77,-65}, {-65,-23}, {-23,-22}, {-22,-21},
                                      {-21,-20}, {-20,-19}, {-19,-18}, {-18,-17}, {-17,-16},
                                      {-16,-15}, {-15,-14}, {-14,-13}, {-13,-12}, {-12,-11},
                                      {-11,-10}, {-10,-9}, {-9,-8}, {-8,-7}, {-7,-4},
                                      {-4,-2}, {-2, -1}, {-1,-32} };

    void Ukr_letter_counter(int* arr, int size);    //метод підрахунку букв
    void Key_shift(int* arr, int size);      //метод для зсуву
    float Frequency_counter(int* arr, int letter_ascii, int size);  //метод підрахунку частоти на колі
    void Difference(float array_of_freq[]);  //метод визначння заальної частоти
    void Ukr_cipher_decryption(int* arr, int size, int key, string& str);   //метод декодування на відомий ключ

};